tylertms/Opentec/source/podium-dd1-dd2-base/source/platform/dspic33e/aux_bus.c
#include "platform/aux_bus.h"

#include <stdbool.h>
#include <stdint.h>
#include <xc.h>

#include "platform/time.h"

typedef enum {
    AUX_BUS_START,
    AUX_BUS_WRITE_ADDRESS,
    AUX_BUS_REGISTER_HIGH,
    AUX_BUS_REGISTER_LOW,
    AUX_BUS_WRITE_DATA,
    AUX_BUS_RESTART,
    AUX_BUS_READ_ADDRESS,
    AUX_BUS_RECEIVE,
    AUX_BUS_ACKNOWLEDGE,
    AUX_BUS_STOP,
} AuxBusPhase;

enum {
    AUX_BUS_BAUD_RATE = 0xa3,
    AUX_BUS_INTERRUPT_PRIORITY = 7,
    AUX_BUS_TIMEOUT_BASE_MS = 20,
};

static volatile PlatformAuxBusStatus status;
static volatile AuxBusPhase phase;
static volatile PlatformAuxBusStatus stop_status;
static uint8_t device_address;
static uint16_t memory_address;
static uint16_t data_length;
static volatile uint16_t data_index;
static const uint8_t *write_data;
static uint8_t *read_data;
static bool reading;
static bool wide_address;
static uint32_t deadline;

/**
 * @brief Starts one interrupt-driven auxiliary-bus transaction.
 *
 * Captures the 7-bit device address, register address, and transfer length, then issues a start
 * condition. A zero transfer length is valid for a register-only write.
 *
 * @param[in] address Seven-bit device address.
 * @param[in] register_address Eight- or sixteen-bit register address.
 * @param[in] length Number of payload bytes to write or read.
 * @return True when the controller accepted the transaction; otherwise false.
 */
static bool start_transaction(uint8_t address, uint16_t register_address, uint16_t length) {
    if (status == PLATFORM_AUX_BUS_BUSY || address >= 0x80) {
        return false;
    }

    device_address = address;
    memory_address = register_address;
    data_length = length;
    data_index = 0;
    wide_address = register_address > UINT8_MAX;
    stop_status = PLATFORM_AUX_BUS_SUCCEEDED;
    phase = AUX_BUS_START;
    status = PLATFORM_AUX_BUS_BUSY;
    deadline = platform_time_ms() + AUX_BUS_TIMEOUT_BASE_MS + length / 16;
    I2C2CONbits.SEN = 1;
    return true;
}

/**
 * @brief Checks a payload-bearing auxiliary-bus transaction request.
 *
 * Rejects a busy controller, an address outside the seven-bit range, a null payload, or an empty
 * payload.
 *
 * @param[in] address Seven-bit device address.
 * @param[in] data Payload source or destination.
 * @param[in] length Number of payload bytes.
 * @return True when the transaction arguments can be queued; otherwise false.
 */
static bool transaction_valid(uint8_t address, const void *data, uint16_t length) {
    return status != PLATFORM_AUX_BUS_BUSY && address < 0x80 && data != 0 && length != 0;
}

static void stop_transaction(PlatformAuxBusStatus result) {
    stop_status = result;
    phase = AUX_BUS_STOP;
    I2C2CONbits.PEN = 1;
}

static bool transmission_failed(void) { return I2C2STATbits.ACKSTAT != 0; }

static void send_register_low(void) {
    I2C2TRN = (uint8_t)memory_address;
    phase = AUX_BUS_REGISTER_LOW;
}

/**
 * @brief Continues after the register address is acknowledged.
 *
 * Restarts the bus for a read, transmits the first write byte, or finishes a register-only write.
 */
static void send_data_or_stop(void) {
    if (reading) {
        I2C2CONbits.RSEN = 1;
        phase = AUX_BUS_RESTART;
        return;
    }

    if (data_length == 0) {
        stop_transaction(PLATFORM_AUX_BUS_SUCCEEDED);
        return;
    }

    I2C2TRN = write_data[data_index++];
    phase = AUX_BUS_WRITE_DATA;
}

static void reset_controller(void) {
    I2C2CONbits.I2CEN = 0;
    I2C2CON = 0;
    I2C2STATbits.IWCOL = 0;
    I2C2STATbits.BCL = 0;
    I2C2STATbits.I2COV = 0;
    I2C2CONbits.SMEN = 1;
    I2C2BRG = AUX_BUS_BAUD_RATE;
    IPC12bits.MI2C2IP = AUX_BUS_INTERRUPT_PRIORITY;
    IFS3bits.MI2C2IF = 0;
    IEC3bits.MI2C2IE = 1;
    I2C2CONbits.I2CEN = 1;
}

void platform_aux_bus_init(void) {
    status = PLATFORM_AUX_BUS_IDLE;
    reset_controller();
}

void platform_aux_bus_service(void) {
    if (status != PLATFORM_AUX_BUS_BUSY || !platform_time_reached(platform_time_ms(), deadline)) {
        return;
    }

    IEC3bits.MI2C2IE = 0;
    reset_controller();
    status = PLATFORM_AUX_BUS_FAILED;
}

/**
 * @brief Starts a register-addressed auxiliary-bus write.
 *
 * A null data pointer with zero length sends only the register address. Nonempty writes require a
 * payload source.
 *
 * @param[in] address Seven-bit device address.
 * @param[in] register_address Eight- or sixteen-bit register address.
 * @param[in] data Payload source, or null for a register-only write.
 * @param[in] length Number of payload bytes.
 * @return True when the transaction starts; otherwise false.
 */
bool platform_aux_bus_start_write(uint8_t address, uint16_t register_address, const uint8_t *data,
                                  uint16_t length) {
    if (length == 0) {
        if (data != 0 || status == PLATFORM_AUX_BUS_BUSY || address >= 0x80) {
            return false;
        }
    } else if (!transaction_valid(address, data, length)) {
        return false;
    }

    reading = false;
    write_data = data;
    read_data = 0;
    return start_transaction(address, register_address, length);
}

bool platform_aux_bus_start_read(uint8_t address, uint16_t register_address, uint8_t *data,
                                 uint16_t length) {
    if (!transaction_valid(address, data, length)) {
        return false;
    }

    reading = true;
    write_data = 0;
    read_data = data;
    return start_transaction(address, register_address, length);
}

PlatformAuxBusStatus platform_aux_bus_status(void) { return status; }

void platform_aux_bus_clear(void) {
    if (status != PLATFORM_AUX_BUS_BUSY) {
        status = PLATFORM_AUX_BUS_IDLE;
    }
}

void __attribute__((interrupt, no_auto_psv)) _MI2C2Interrupt(void) {
    bool bus_error = I2C2STATbits.IWCOL != 0 || I2C2STATbits.BCL != 0 || I2C2STATbits.I2COV != 0;
    I2C2STATbits.IWCOL = 0;
    I2C2STATbits.BCL = 0;
    I2C2STATbits.I2COV = 0;

    if (bus_error && phase != AUX_BUS_STOP) {
        stop_transaction(PLATFORM_AUX_BUS_FAILED);
        IFS3bits.MI2C2IF = 0;
        return;
    }

    switch (phase) {
    case AUX_BUS_START:
        I2C2TRN = (uint8_t)(device_address << 1);
        phase = AUX_BUS_WRITE_ADDRESS;
        break;
    case AUX_BUS_WRITE_ADDRESS:
        if (transmission_failed()) {
            stop_transaction(PLATFORM_AUX_BUS_FAILED);
        } else if (wide_address) {
            I2C2TRN = (uint8_t)(memory_address >> 8);
            phase = AUX_BUS_REGISTER_HIGH;
        } else {
            send_register_low();
        }
        break;
    case AUX_BUS_REGISTER_HIGH:
        if (transmission_failed()) {
            stop_transaction(PLATFORM_AUX_BUS_FAILED);
        } else {
            send_register_low();
        }
        break;
    case AUX_BUS_REGISTER_LOW:
        if (transmission_failed()) {
            stop_transaction(PLATFORM_AUX_BUS_FAILED);
        } else {
            send_data_or_stop();
        }
        break;
    case AUX_BUS_WRITE_DATA:
        if (transmission_failed()) {
            stop_transaction(PLATFORM_AUX_BUS_FAILED);
        } else if (data_index < data_length) {
            I2C2TRN = write_data[data_index++];
        } else {
            stop_transaction(PLATFORM_AUX_BUS_SUCCEEDED);
        }
        break;
    case AUX_BUS_RESTART:
        I2C2TRN = (uint8_t)((device_address << 1) | 1u);
        phase = AUX_BUS_READ_ADDRESS;
        break;
    case AUX_BUS_READ_ADDRESS:
        if (transmission_failed()) {
            stop_transaction(PLATFORM_AUX_BUS_FAILED);
        } else {
            I2C2CONbits.RCEN = 1;
            phase = AUX_BUS_RECEIVE;
        }
        break;
    case AUX_BUS_RECEIVE:
        read_data[data_index++] = I2C2RCV;
        I2C2CONbits.ACKDT = data_index == data_length;
        I2C2CONbits.ACKEN = 1;
        phase = AUX_BUS_ACKNOWLEDGE;
        break;
    case AUX_BUS_ACKNOWLEDGE:
        if (data_index == data_length) {
            stop_transaction(PLATFORM_AUX_BUS_SUCCEEDED);
        } else {
            I2C2CONbits.RCEN = 1;
            phase = AUX_BUS_RECEIVE;
        }
        break;
    case AUX_BUS_STOP:
        status = stop_status;
        break;
    }

    IFS3bits.MI2C2IF = 0;
}
